

#Область ОбработчикиКомандФормы
	
&НаКлиенте
Процедура СоздатьРеализации(Команда)
	
	Если ЗначениеЗаполнено(Объект.Период) Тогда
		ДлительнаяОперация = СоздатьРеализацииНаСервере();
		Оповещение = Новый ОписаниеОповещения("ВыполнитьВФонеЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение);
	Иначе
	    ОбщегоНазначенияКлиент.СообщитьПользователю("Заполните ПЕРИОД!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьРеализацииНаСервере()
	
	ИмяМетода = "Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьДокументыРеализации";
	Возврат ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, ИмяМетода, Объект.Период.ДатаНачала, Объект.Период.ДатаОкончания);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьВФонеЗавершение(Результат, ДопПараметры) Экспорт
	
	Таб = ПолучитьИзВременногоХранилища(Результат.АдресРезультата); 
	Объект.СписокДокументов.Очистить();
	Объект.СписокДокументов.Загрузить(Таб);
	Объект.СписокДокументов.Сортировать("Договоры");
	
КонецПроцедуры

#КонецОбласти

