#Область ПрограммныйИнтерфейс

Процедура ВКМ_ОтправкаСообщенийБоту() Экспорт

	Попытка
		
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса();
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
			
		Пока Выборка.Следующий() Цикл
			
			ДанныеОтвета = ОтправитьСообщениеБоту(Выборка.ТекстСообщения);
			Если ДанныеОтвета.Свойство("error_code") Тогда
				Если ДанныеОтвета.error_code = 200 Тогда
					Справочники.ВКМ_УведомленияТелеграмБоту.УдалитьУведомлениеБоту(Выборка.Ссылка);
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	Исключение
		
	КонецПопытки
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ОтправитьСообщениеБоту(ТекстСообщения)
	
	Попытка
	
		ДанныеДляВыгрузки = Новый Структура;
		ДанныеДляВыгрузки.Вставить("chat_id", Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить());
		ДанныеДляВыгрузки.Вставить("text", ТекстСообщения);
		
		Запись = Новый ЗаписьJSON;
		Запись.УстановитьСтроку();
		ЗаписатьJSON (Запись, ДанныеДляВыгрузки);
		Данные = Запись.Закрыть();
		
		Сервер = "api.telegram.org";
		
		Соединение = Новый HTTPСоединение("api.telegram.org",,,);
		СтрокаЗапроса = СтрШаблон("/bot%1/sendMessage", Константы.ВКМ_ТокенУправленияТелеграм_ботом.Получить());
		HTTPЗапрос = Новый HTTPЗапрос(СтрокаЗапроса); 
		HTTPЗапрос.Заголовки.Вставить("Content-type", "application/json");
		HTTPЗапрос.УстановитьТелоИзСтроки(Данные, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		Ответ = HTTPОтвет.ПолучитьТелоКакСтроку();		
		
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(Ответ);
		Результат = ПрочитатьJSON(Чтение);
			
		Чтение.Закрыть();
	
	Исключение
		
		Результат = ОписаниеОшибки();
		ЗаписатьОшибкуВЖурналРегистрации(Результат);		
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьОшибкуВЖурналРегистрации(Результат)

	СписокСобытий = Новый СписокЗначений;
	
	СтруктураСобытия = Новый Структура;
	СтруктураСобытия.Вставить("ИмяСобытия", "Работа с телеграм ботом");
	СтруктураСобытия.Вставить("ПредставлениеУровня", "Ошибка");
	СтруктураСобытия.Вставить("Комментарий", Результат);
		
	СписокСобытий.Добавить(СтруктураСобытия);
		
	ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СписокСобытий);
	
КонецПроцедуры

Функция ТекстЗапроса() 

	ТекстЗапроса = "ВЫБРАТЬ
	               |	ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения,
	               |	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти