#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Адрес"  Тогда
        Если ЗначениеЗаполнено(Параметр) Тогда
            ЗаполнитьДиаграммуГанта(Параметр);
        КонецЕсли;        
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДиаграммуГанта(АдресВХранилище)
		
	ТабЧасть = ПолучитьИзВременногоХранилища(АдресВХранилище);
	
	Для Каждого Стр из ТабЧасть Цикл
		Точка = ДиаграммаГанта.УстановитьТочку(Стр.Сотрудник);
		Серия = ДиаграммаГанта.УстановитьСерию(Стр.Сотрудник);
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Интервал.Начало = Стр.ДатаНачала;
		Интервал.Конец = Стр.ДатаОкончания;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти



