#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

 &НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	
	ЗаполнитьОбщееКоличествоДнейОтпуска();
	ЗаполнитьКоличествоДнейОтпускаПлан();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)

	ЗаполнитьОбщееКоличествоДнейОтпуска();
	ЗаполнитьКоличествоДнейОтпускаПлан();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьАнализГрафика(Команда)
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика");
	
	Адрес = ЗаписатьВХранилище();
    Оповестить("Адрес", Адрес,);
    Закрыть(Адрес);
		
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьОбщееКоличествоДнейОтпуска()
	
	Строка = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	ЗаполнитьОбщееКоличествоДнейОтпускаСотрудника(Строка.Сотрудник);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбщееКоличествоДнейОтпускаСотрудника(Сотрудник)
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Сотрудник", Сотрудник);
	
	ТабЧасть = Объект.ОтпускаСотрудников.НайтиСтроки(СтруктураОтбора);
	
	КоличествоДней = 0;
	Для Каждого Стр из ТабЧасть Цикл
		КоличествоДней = КоличествоДней + ((Стр.ДатаОкончания - Стр.ДатаНачала) / 86400);
	КонецЦикла;
	
	Для Каждого Стр из ТабЧасть Цикл
		Стр.ОбщееКоличествоДнейОтпуска = КоличествоДней;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКоличествоДнейОтпускаПлан()
	
	Строка = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	Строка.КоличествоДнейОтпускаПлан = (Строка.ДатаОкончания - Строка.ДатаНачала) / 86400;
			
КонецПроцедуры

&НаСервере
Функция ЗаписатьВХранилище()
	
	ТабЧасть = Объект.ОтпускаСотрудников.Выгрузить();
	Возврат ПоместитьВоВременноеХранилище(ТабЧасть);
	
КонецФункции

#КонецОбласти